In [2]:
import pandas as pd
# Series in Pandas
data = [10, 20, 30, 40, 50]
my_series = pd.Series(data)
print(my_series)
print(my_series[2])

0    10
1    20
2    30
3    40
4    50
dtype: int64
30

In [6]:
a = [1, 2, 5]
a_series = pd.Series(a, index = ["x", "y", "z"])
print(a_series)
#print(a_series["y"])

x    1
y    2
z    5
dtype: int64
2

In [8]:
 # create a dictionary with key value pairs
grades = {"Sem1" : 8.25, "Sem2" : 9.5, "Sem3" :7.75}
 # create a series from the dictionary
my_series = pd.Series(grades)
print(my_series)

first_year = pd.Series(grades, index =["Sem1", "Sem2"])
print(first_year)

Sem1    8.25
Sem2    9.50
Sem3    7.75
dtype: float64
Sem1    8.25
Sem2    9.50
dtype: float64

In [61]:
import numpy as np
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [21]:
# create a DataFrame from the list
data = [['John', 25, 'New York'],
       ['Alice', 30, 'London'],
       ['Bob', 35, 'Paris']]
df = pd.DataFrame(data)
df

       0   1         2
0   John  25  New York
1  Alice  30    London
2    Bob  35     Paris

In [22]:
df = pd.DataFrame(data, columns = ['Name', 'Age', 'City'])
df

    Name  Age      City
0   John   25  New York
1  Alice   30    London
2    Bob   35     Paris

In [24]:
# Pandas DataFrame Using Python Dictionary
data = {'year':[2010 , 2011 , 2012 ,2010 , 2011 , 2012 ,2010 , 2011 , 2012], 
        'team' :['FCBarcelona', 'FCBarcelona','FCBarcelona','RMadrid','RMadrid','RMadrid', 'ValenciaCF', 'ValenciaCF', 'ValenciaCF'],
        'wins' :[30 , 28 , 32 , 29 , 32 , 26 , 21 , 17 , 19],
        'draws':[6 , 7, 4, 5, 4, 7, 8, 10 , 8] ,
        'losses': [2 , 3, 2, 4, 2, 5, 9, 11 , 11]
       }
football = pd.DataFrame(data, columns =['year','team','wins', 'draws', 'losses'])
football

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

In [27]:
# From CSV File
df = pd.DataFrame()   # create an empty DataFrame
df = pd.read_csv('Employee.csv')
df
#df = pd.read_csv('./csv_files/data.csv', header = 0)

   Employee ID First Name Last Name Department     Position  Salary
0          101       John       Doe  Marketing      Manager   50000
1          102       Jane     Smith      Sales    Associate   35000
2          103    Michael   Johnson    Finance      Analyst   45000
3          104      Emily  Williams         HR  Coordinator   40000

In [6]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
         'Age': [25, 30, 35, 28],
         'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])
#df
#print(df.loc['A'])    #selected_row = df.loc['A']
#print(df.loc['B'])    #print(selected_row)

selected_data = df.loc[['A','C'], ['Name', 'Age']]

#print(selected_data)

cd1 = df.loc['B':'C',['Name','Age']]
cd2 = df.loc[:,['Name','Age']]
cd3 = df.loc[:]
print(cd1,"\n")
print(cd2,"\n")
print(cd3,"\n")

#sr2 = df.loc[['A','C']:]   #Error
#print(sr2)
sr1 = df.loc[df['Age'] >= 30]              # sr1 = df.loc['Age'] > 30  Invalid syntax
#print(sr1)

      Name  Age
B      Bob   30
C  Charlie   35

      Name  Age
A    Alice   25
B      Bob   30
C  Charlie   35
D    David   28

      Name  Age         City
A    Alice   25     New York
B      Bob   30  Los Angeles
C  Charlie   35      Chicago
D    David   28      Houston

In [54]:
# category data type 
# All values here are either in categories or np.nan
s = pd.Series(['a', 'b','c','d','a'], dtype ="category")
s

0    a
1    b
2    c
3    d
4    a
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [55]:
df = pd.DataFrame({"A" : ['a', 'b','c','d','a']})
df["B"] = df["A"].astype("category")
df

   A  B
0  a  a
1  b  b
2  c  c
3  d  d
4  a  a

In [7]:
# pandas astype( )
data = {'A' : ['1', '2', '3'], 'B' : ['4.5','5.7','6.8']}
df = pd.DataFrame(data)
# convert entire DataFrame to float
df = df.astype(float)
print(df)
print("\n")

# convert column A to float
df2 = pd.DataFrame(data)
converted_A = df2['A'].astype(float)
#print(df2)
#print(converted_A)

data2 = {'A':['1', '2', '3'],'B':['4','5', '6']}

# convert column B to float
df3 = pd.DataFrame(data2)
converted_B = df3['B'].astype(float)
#print(converted_B)
df3 = df3.astype({'A': int, 'B': float})
#print(df3)

     A    B
0  1.0  4.5
1  2.0  5.7
2  3.0  6.8

In [ ]:
data = {'A':['1', '2', '3'],'B':['4','5', '6']}
# convert column B to float

In [10]:
import numpy as np
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'], 
        'Age': [25, 32, 18, 47, 33],
        'City':['New York', 'Paris', 'London', 'Tokyo', 'Sydney']}
df = pd.DataFrame(data)
names = df['Name']
#print(names)
name_city = df[['Name', 'City']]
#print(name_city)
df2 = pd.DataFrame(
    { "A" : 1.0, "B" :pd.Timestamp("20250828"),
      "C" : pd.Series(1, index = list(range(4)), dtype = "float32"),
      "D" : np.array([3]*4, dtype ="int32"),
      "E" : pd.Categorical(["test", "train", "test", "train"]),
      "F" : "foo", 
    })
df2
#df2.dtypes

     A          B    C  D      E    F
0  1.0 2025-08-28  1.0  3   test  foo
1  1.0 2025-08-28  1.0  3  train  foo
2  1.0 2025-08-28  1.0  3   test  foo
3  1.0 2025-08-28  1.0  3  train  foo

In [11]:
# Some other Pandas fucntions
dates = pd.date_range("20250801", periods = 6)
#dates
df = pd.DataFrame(np.random.randn(6,4), index = dates , columns = list("ABCD"))
df

                   A         B         C         D
2025-08-01 -1.868142  0.710928 -0.224290  0.763604
2025-08-02 -0.308521 -0.418667  0.266614  0.724280
2025-08-03  0.489485  0.468655  0.863935  0.148352
2025-08-04 -0.628938  1.083220  0.966380 -0.132051
2025-08-05  0.684930 -0.990024  0.277525 -0.604277
2025-08-06 -1.238868 -0.018807  1.255554 -1.425595

In [78]:
# Some other Pandas fucntions
dates = pd.date_range("20250801", periods = 6)
#dates
df = pd.DataFrame(np.random.randn(6,4), index = dates , columns = list("ABCD"))
df
df.head()
df.tail(2)
df.index
df.columns
df.to_numpy()
df.describe()
df.T               #Transpose
df["A"]
df.A

2025-08-01   -0.157162
2025-08-02    0.720225
2025-08-03    1.042841
2025-08-04   -0.331081
2025-08-05    1.699231
2025-08-06    0.853944
Freq: D, Name: A, dtype: float64

In [80]:
data = {'Name': ['John', 'Alice', 'Bob'],
        'Age': [25, 30, 35],
      'City': ['New York', 'London', 'Paris']}
df = pd.DataFrame(data)                      # create a dataframe from the dictionary
df.to_csv('output.csv',index= False)         # write dataframe to csv file
df.duplicated(subset=['Name', 'Age'])
df.drop_duplicates(inplace=True)

In [84]:
# create dataframe
data = {'Name': ['Tom', 'Nick', 'John', 'Tom'],
        'Age': [20, 21, 19, 18],
        'City': ['New York', 'London', 'Paris', 'Berlin']}
df = pd.DataFrame(data)
# write to csv file
df.to_csv('Result.csv',sep =';',index = False, header = True)
df

   Name  Age      City
0   Tom   20  New York
1  Nick   21    London
2  John   19     Paris
3   Tom   18    Berlin

In [88]:
# Data prepocessing
data ={'A': [1, 2, 3, None, 5],
       'B': [None, 2, 3, 4, 5],
       'C': [1, 2, None, None, 5]}
df = pd.DataFrame(data)
print("Original Data:\n",df)

# use dropna() to remove rows with any missing values
#df_cleaned = df.dropna()
#print("Cleaned Data:\n",df_cleaned)

# filling NaN values with 0
df.fillna(0, inplace=True)
print("\nData after filling NaN with 0:\n", df)

Original Data:
      A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  3.0  3.0  NaN
3  NaN  4.0  NaN
4  5.0  5.0  5.0

Data after filling NaN with 0:
      A    B    C
0  1.0  0.0  1.0
1  2.0  2.0  2.0
2  3.0  3.0  0.0
3  0.0  4.0  0.0
4  5.0  5.0  5.0

In [3]:
import pandas as pd
data = {
    'Name': ['John', 'Michael', 'Tom', 'Alex', 'Ryan'],
    'Age': [8, 9, 7, 80, 100],    
    'Gender': ['M', 'M', 'M', 'F', 'M'],
    'Standard': [3, 4, 12, 3, 5]}
df = pd.DataFrame(data)

 # replace F with M
df.loc[3,'Gender'] = 'M'
df

 # replace values based on conditions
for i in df.index:
    age_val = df.loc[i,'Age']
    if(age_val > 14) and (age_val%10 == 0):
        df.loc[i,'Age'] = age_val/10
print(df)

      Name  Age Gender  Standard
0     John    8      M         3
1  Michael    9      M         4
2      Tom    7      M        12
3     Alex    8      F         3
4     Ryan   10      M         5

In [5]:
# Example 2: Outlier Treatment
#data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Age': [25, 30, 22, 35, 28]}
#df = pd.DataFrame(data)

df2 = df.drop(df.index [(df.income == '>50K\n') & (df['age'] > df['age'].median() + 35) & (df['age'].median() -15)])
ml1_age = m11['age']
fm1_age = fm1['age']
ml2_age = ml1_age.drop(ml1_age.index[(ml1_age > df['age'].median() + 35) & (ml1_age > df['age'].median() -15)])
fm2_age = fm1_age.drop(fm1_age.index[(fm1_age > df['age'].median() + 35) & (fm1_age > df['age'].median() -15)])

# wrong dataset

AttributeError: 'DataFrame' object has no attribute 'income'

In [22]:
# Dataframe sample function
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Age': [25, 30, 22, 35, 28]}
df = pd.DataFrame(data)
#df
sampled_rows = df.sample(n=2) #sample() func : Generate diff samples everytime
print(sampled_rows)

      Name  Age
3    David   35
2  Charlie   22

In [54]:
sampled_rows = df.sample(n=3)
print("Selected 3 random rows:",sampled_rows)
sampled_fraction = df.sample(frac = 0.3)
print("Selected 30% of the rows randomly:\n",sampled_fraction)
sampled_with_replacement = df.sample(n=5, replace = True)
print("Sampled with replacement (allowing duplicates):")
print(sampled_with_replacement)

Selected 3 random rows:    Student_ID     Name  Score
2         103  Charlie     78
0         101    Alice     85
1         102      Bob     92
Selected 30% of the rows randomly:
    Student_ID Name  Score
1         102  Bob     92
Sampled with replacement (allowing duplicates):
   Student_ID     Name  Score
2         103  Charlie     78
1         102      Bob     92
0         101    Alice     85
0         101    Alice     85
2         103  Charlie     78

In [12]:
# loc() function 

data={'Name':['Alice','Bob','Charlie','David', 'Eve'],
      'Age': [25, 32, 28, 22, 30],
      'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']}
df = pd.DataFrame(data) 
# access a single row
single_row = df.loc[2]
print(single_row,"\n")
 
# access rows 0, 3 and 4
row_list = df.loc[[0 ,3, 4]]
print(row_list)
print("\n")

# access a list of columns
column_list = df.loc[:,['Name','Age']]
print(column_list)
print("\n")

# access second row of 'Name' column
specific_value = df.loc[1, 'Name']
print(specific_value)

Name    Charlie
Age          28
City    Chicago
Name: 2, dtype: object

    Name  Age      City
0  Alice   25  New York
3  David   22   Houston
4    Eve   30     Miami


      Name  Age
0    Alice   25
1      Bob   32
2  Charlie   28
3    David   22
4      Eve   30


Bob

In [13]:
# iloc() func
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
# select the element in the first row and second column
element = df.iloc[0,1]
print(element)  

# select rows 1 to 3 (exclusive) and columns 1 to 3 (exclusive)
selected_data = df.iloc[1:3, 1:3]
print(selected_data)  

# select specific rows (rows 0 and 2) and specific columns (columns 1 and 3)
#specific_rows = df.iloc[[0, 2], [1, 3]]
#print(specific_rows)

4
   B
1  5
2  6

In [47]:
# Eample -2 iloc() func 
data = {'Student_ID': [101, 102, 103],
        'Name': ['Alice', 'Bob', 'Charlie'],
        'Score': [85, 92, 78]}
df = pd.DataFrame(data)
# select all rows for the 'Student_ID' and 'Name' columns
selected_data = df.iloc[:,[1,2]]
print(selected_data)  

# select rows 1 and 3 for all columns
#selected_rows = df.iloc[[1,3],:]
#print(selected_rows)

      Name  Score
0    Alice     85
1      Bob     92
2  Charlie     78